rottenpotatoes/app/controllers/movies_controller.rb

  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:order => :title}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:order => :release_date}, 'hilite'
    when 'director'
      ordering,@director_header = {:order => :director}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'NC-17', 'PG', 'PG-13', 'R') ORDER BY release_date

  def sdirector
    @the_movie = Movie.find(params[:id])
    if @the_movie.director.nil?
      flash[:notice] = "'#{@the_movie.title}' has no director info"
      redirect_to movies_path and return
    end
    @movies    = Movie.find_all_by_director(@the_movie.director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'Bob'